## Plan Result (sds_dev_ado)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.mi_polybasestaging_owner[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.mi_polybasestaging_owner[0] will be created
  + resource "azurerm_role_assignment" "mi_polybasestaging_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "26f5a1bd-d791-4a08-9662-5babd1c3a903"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/mipolybasestagingdev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"sds_dev_ado","Vars":{}} -->